shrimpSignsDict = {
    #For /stest
    'stest':3.,

    ####아래는 본인이 직접 선택해야 하는 부정어들####
    # 안전을 위한다면 모두 -10으로,
    # 대신 ban=-10 인데 cband나 banana 같은 코인이 나오면 못삼 진짜로 정말로
    '실험': 0.,
    (('ban',), ('bana', 'banb', 'banc', 'bank')): -10.,
    (('end',), ('lend', 'mend')): -10.,
    (('lock',), ('block', 'clock')): -10.,
    (('off',), ('offi', 'offl', 'offe')): -10.,
    'wait': -10., 'miss': -10., 'dead': -10., 'bug': -10., 'warn': -10., ('take', 'off'): -10., ('take', 'out'): -10., 'shut': -10., 'issue': -10.,
    'late': -10., 'leave': -10., 'bad': -10., 'lost': -10., 'airdrop': -10., '에어드랍': -10.,
    ####위는 본인이 직접 선택해야 하는 부정어들####

    ### temporary tuple for all exchages ###

    (('신규', '지갑'),('de-list', 'delist', '폐지', '제거', '중지')):1., (('신규', '마켓'),('de-list', 'delist', '폐지', '제거', '중지')):1.,  (('코인', '추가'),('de-list', 'delist', '폐지', '제거', '중지')):1.,
    (('상장', '안내'),('de-list', 'delist', '폐지', '제거', '중지')):1., (('상장', '예정'),('de-list', 'delist', '폐지', '제거', '중지')):1., ('상장', '완료'):-1.,

    ###gateio###

    ('gateio', '신규', '마켓'):1.,

    ###IDEX###

    ('idex', '신규', '마켓'):1.,

    ##hitbtc##

    ('hitbtc', '신규', '지갑'):1.,

    ####아래는 binance 상장 문구####
    (('list', 'binance'), ('delist', 'unlist', 'de-list', 'un-list')): 1., ('add', '(binance)'): 1.,
    ('open', '(binance)'): 1., ('trading on', '(binance)'): 1., ('sale', '(binance)'): 1.,
    ('(binance)', '신규', '지갑'): 1., ('(binance)', '거래', '시작'): 1., ('(binance)', '신규', '마켓'):1.,
    ('(binance)', '신규', '상장'): 1., ('(binance)', '새', '지갑', '주소'): 1., ('(binance)', '발표', '상장'): 1.,

    ####아래는 bittrex 상장 문구####
    ('(bittrex)', '신규'): 1.,

    ####아래는 bitfinex 상장 문구####
    ('(bitfinex)', '신규'): 1.,

    ####아래는 영어 부정어 문구(공통)=반드시 -여야만 한다.####
    'fail': -10., (('none',), ('coinone',)): -10., 'pend': -10., 'anomaly': -10., 'suspen': -10.,
    'ddos': -10., 'delay': -10., 'risk': -10., 'maintenance': -10., 'fix': -10., 'sorry': -10., 'abuse': -10.,
    'improper': -10., 'manipulat': -10., 'investigat': -10., (('chang',), ('exchang',)): -10.,
    'redemption': -10., 'redeem': -10., 'postpone': -10.,

    'alert': -10., 'debit': -10., 'disabl': -10., 'reject': -10.,
    'refund': -10.,

    (('[okex]', 'support', 'trad'), ('spot',)): -1.,

    'remov': -10., 'delet': -10., 'eliminat': -10., 'subtract': -10., 'stop': -10., 'clos': -10.,
    'de-list': -10., 'unlist': -10., 'un-list': -10., 'delist': -10.,

    ('(upbit)', 'btc'): -100., ('(upbit)', 'eth'): -100., ('(upbit)', 'usdt'): -100.,

    'abandon': -10., 'abolish': -10., 'abolit': -10., 'abort': -10., 'abus': -10., 'adjourn': -10.,
    'annul': -10., 'away with': -10.,
    'break down': -10., 'broke down': -10., 'broken down': -10., 'call off': -10., 'cancel': -10.,
    'caution': -10., 'cease': -10., 'criminal': -10.,
    'defect': -10., 'defer': -10.,
    'disappear': -10., 'discard': -10., 'erase': -10., 'error': -10.,
    'exclude': -10., 'expiration': -10., 'fake': -10., 'fault': -10., 'finish': -10.,
    'forbid': -10., 'freeze': -10., 'give up': -10., 'hold over': -10., 'illegal': -10.,
    'impede': -10., 'imperfect': -10., 'incompetent': -10., 'inconvenient': -10.,
    'inspect': -10., 'interrupt': -10.,
    'maintain': -10.,
    'modification': -10., 'outlaw': -10., 'problem': -10.,
    'procrastinate': -10., 'prohibit': -10., 'put off': -10., 'quit': -10.,
    'repeal': -10., 'restriction': -10.,
    'revoke': -10., 'rumor': -10., 'sanction': -10., 'scam': -10., 'shelve': -10.,

    'terminat': -10., 'throw away': -10., 'turn off': -10., 'unfair': -10., 'unstable': -10.,
    'false': -10.,

    ####아래는 upbit 상장 문구####
    (('(upbit)', '[거래]', '코인', '추가'), ('종료', '폐지', '마감')): 1.,
    (('(upbit)', '[거래]', '신규', '상장'), ('종료', '폐지', '마감')): 1.,
    (('(upbit)', '[거래]', '거래', '오픈'), ('종료', '폐지', '마감')): 1.,
    (('(upbit)', '[이벤트]', '쏩니다'), ('종료', '폐지', '마감')): 1.,
    (('(upbit)', '[이벤트]', '상장', '기념'), ('종료', '폐지', '마감')): 1.,
    (('(upbit)', '[신규상장]'), ('종료', '폐지', '마감')): 1.,
    (('(upbit)', '[상장예정]'), ('종료', '폐지', '마감')): 1.,
    (('(upbit)', '[이벤트]', '업비트가'), ('종료', '폐지', '마감')): 1.,
    ('(upbit)', '거래', '시작', 'krw'): 1., ('api', '감지', 'krw'): 1.,
    ('(upbit)', 'api', '리스트', 'krw'): 1.,

    ####아래는 bithumb&pro 상장 문구####
    (('[bithumb', '상장'), ('지연', '변경', '종료', '폐지')): 1.,

    ####아래는 한글 부정어 문구(공통)=반드시 -여야만 한다.####
    '경고': -10., '금지': -10., '늦': -10., '루머': -10., '마감': -10.,
    '문제': -10., '버그': -10., '변경': -10., '불가능': -10.,
    '불공정': -10., '불량': -10., '불법': -10., '불안정': -10., '비정상': -10., '사기': -10., '사칭': -10., '삭제': -10.,
    '수정': -10.,
    '신고': -10., '실패': -10., '오류': -10., '유언비어': -10., '유의': -10., ('이상', '거래'): -10., ('이상', '입금'): -10.,
    '장애': -10.,
    '점검': -10., '정검': -10., '정지': -10., '제외': -10., '제재': -10., '제한': -10., '조정': -10., '주의': -10.,
    '중단': -10.,
    '중지': -10., '지연': -10., '연기': -10., '처벌': -10., '취소': -10., '탈퇴': -10., '피해': -10., '허위': -10.,
    '상폐': -10., '제거': -10., '종료': -10., '폐지': -10.,

    '횡령': -10., '착오': -10., '법원': -10., '범죄': -10., '실수': -10., '디도스': -10., '법적': -10.,
    '불편': -10., '분실': -10., '가짜': -10., '고장': -10., '끝': -10., '동결': -10., '만료': -10.,
    '배제': -10., '스캠': -10., '예외': -10., '위법': -10., '지체': -10., '철회': -10., '세일': -5.,

    '당첨': -10.,

    ####아래는 okex 상장 문구####

    ('[okex]', 'now', 'available'): 1., ('[okex]', 'launch'): 1., ('[okex]', 'list'): 1.,
    ('[okex]', 'trad', 'spot'): 1.,

    ('[okex]', '上线'): 1, ('[okex]', '全球', '首发', '的公告'): 1., ('[okex]', '신규', '지갑'): 1.,
    ('[okex]', '상장', '발표'): 1.,

    ####아래는 huobi 문구####
    ('[huobi', '上线', '月', '日'): 1., ('[huobi', '全球通用', '月', '日'): 1.,
    ('[huobi', '全球首发', '月', '日'): 1.,
    ('[huobi', '交易排名赛', 'top'): 1.,  # 특정 코인의 거래량이 많은 사람에게 보상을 하는 제도, 보통 상장과 함께 진행되는 경우가 많음
    ('[huobi', '火币', '交易', '月', '日'): 0.,  # 상장이 아니지만 거래의 시작이나 마진 거래를 알리는 문구, 추후에 1로 상향 가능
    ('[huobi', '신규', '마켓'): 1., ('[huobi', '신규', '지갑'): 1.,

    ('[huobi', '全面'): -1., ('[huobi', '项目'): -1., ('[huobi', '法币'): -1.,
    ('[huobi', '发布'): 0., ('[huobi', '广告'): -1., ('[huobi', '调整'): -1., ('[huobi', '费率'): -1.,
    ('[huobi', '更新'): -1., ('[huobi', '系统'): -1., ('[huobi', '及大宗'): -1., ('[huobi', '国际化'): -1.,
    ('[huobi', '平台'): -1., ('[huobi', '方案'): -1., ('[huobi', '态度'): -1., ('[huobi', '用户'): -1.,
    ('[huobi', '回馈'): -1., ('[huobi', '分叉'): -1., ('[huobi', '开采'): -1., ('[huobi', '平台的'): -1.,
    ('[huobi', '维护'): -1., ('[huobi', '充值'): -1., ('[huobi', '理方案'): -1., ('[huobi', '提现的公告'): -1.,
    ('[huobi', '充提业务'): -1., ('[huobi', '充值业务'): -1., ('[huobi', '领取'): -1., ('[huobi', '积分'): 0.,
    ('[huobi', '官方'): -1., ('[huobi', '准时'): -1., ('[huobi', '投票'): -1., ('[huobi', '开启'): -1.,
    ('[huobi', '二轮'): -1., ('[huobi', '专场'): -1., ('[huobi', '活动第'): -1., ('[huobi', '招募'): -1.,
    ('[huobi', '商家'): -1., ('[huobi', '进行'): -1., ('[huobi', '第三期'): -1., ('[huobi', '处'): -1.,
    ('[huobi', '狂撒'): -1., ('[huobi', '新注册就'): -1., ('[huobi', '各种'): -1., ('[huobi', '一轮'): -1.,
    ('[huobi', '结果'): -1., ('[huobi', '返还'): -1., ('[huobi', '充币'): -1., ('[huobi', '期间'): -1.,
    ('[huobi', '规则'): -1., ('[huobi', '手续费'): -1., ('[huobi', '赢'): -1., ('[huobi', '买免'): -1.,
    ('[huobi', '活动'): -1., ('[huobi', '节点'): -1., ('[huobi', '识'): -1., ('[huobi', '答题'): -1.,
    ('[huobi', '三轮'): -1., ('[huobi', '合作'): -1., ('[huobi', '将为'): -1., ('[huobi', '免息'): -1.,
    ('[huobi', '卡疯'): -1., ('[huobi', '示'): -1., ('[huobi', '地址'): -1., ('[huobi', '更名'): -1.,
    ('[huobi', '入围'): -1., ('[huobi', '游'): -1., ('[huobi', '持仓'): -1., ('[huobi', '进'): -1.,
    ('[huobi', '专享'): -1., ('[huobi', '征求'): -1., ('[huobi', '定稿'): -1., ('[huobi', '意见'): -1.,
    ('[huobi', '期至'): -1., ('[huobi', '支持'): -1., ('[huobi', '影响'): -1., ('[huobi', '列表'): -1.,
    ('[huobi', '详情'): -1., ('[huobi', '套餐'): 0., ('[huobi', '名单'): -1., ('[huobi', '新年'): -1.,
    ('[huobi', '机制'): -1., ('[huobi', '元旦'): -1., ('[huobi', '上调'): -1., ('[huobi', '网站'): -1.,
    ('[huobi', '盗用'): -1., ('[huobi', '优惠'): -1., ('[huobi', '认证'): -1., ('[huobi', '的声'): -1.,
    ('[huobi', '资料'): -1., ('[huobi', '现金'): -1., ('[huobi', '分发'): -1., ('[huobi', '已完'): -1.,
    ('[huobi', '邀'): -1., ('[huobi', '升级'): -1., ('[huobi', '补偿'): -1.,
    ('[huobi', '都有'): 0., ('[huobi', '继续'): -1., ('[huobi', '抢购'): -1., ('[huobi', '全民'): -1.,
    ('[huobi', '狂欢'): -1., ('[huobi', '设立'): -1., ('[huobi', '功能'): -1., ('[huobi', '并赠'): 0.,
    ('[huobi', '连续'): -1., ('[huobi', '社群'): -1., ('[huobi', '额度'): -1., ('[huobi', '安全'): -1.,
    ('[huobi', '名义'): -1., ('[huobi', '最小'): -1., ('[huobi', '欢迎'): -1., ('[huobi', '扩量'): -1.,
    ('[huobi', '临时'): -1., ('[huobi', '产品'): -1., ('[huobi', '服务'): -1., ('[huobi', '再次'): -1.,
    ('[huobi', '不间断'): -1.,

    ('[huobi', '返佣'): -10., ('[huobi', '退票'): -10., ('[huobi', '延'): -10.,
    ('[huobi', '退出'): -10., ('[huobi', '完善'): -10.,
    ('[huobi', '未能'): -10., ('[huobi', '结束'): -10., ('[huobi', '冒用'): -10.,

    ####아래는 중어 부정어 문구(공통)=반드시 -여야만 한다.####
    '故': -10, '变': -10, '失': -10, '失败': -10, '延': -10, '缓': -10, '维护': -10, '障': -10, '停': -10,
    '调': -10, '迟': -10,
    '清算': -10, '败': -10, '风险': -10, '下架': -10, ('关于', '交易'): -10.,

    '返佣': -10, '退票': -10, '退': -10, '完善': -10, '冒用': -10, '未': -10, '结束': -10, '虚': -10,
    '假': -10, '盗': -10, '不': -10, '发放': -10, '消': -10, '未能': -10, '退出': -10, '提现': -10, '化': -10., }

upbitSubjectSignsDict = {(('[거래]', '코인', '추가'), ('종료', '폐지', '마감')): 1.,
                         (('[거래]', '신규', '상장'), ('종료', '폐지', '마감')): 1.,
                         (('[거래]', '거래', '오픈'), ('종료', '폐지', '마감')): 1., (('[이벤트]', '쏩니다'), ('종료', '폐지', '마감')): 1.,
                         (('[이벤트]', '상장', '기념'), ('종료', '폐지', '마감')): 1., (('[신규상장]',), ('종료', '폐지', '마감')): 1.,
                         (('[상장예정]',), ('종료', '폐지', '마감')): 1., (('[이벤트]', '업비트가'), ('종료', '폐지', '마감')): 1.,

                         '당첨': -10.,

                         '경고': -10., '금지': -10., '늦': -10., '루머': -10., '마감': -10., '문제': -10., '버그': -10., '변경': -10.,
                         '불가능': -10.,
                         '불공정': -10., '불량': -10., '불법': -10., '불안정': -10., '비정상': -10., '사기': -10., '사칭': -10.,
                         '삭제': -10.,
                         '수정': -10.,
                         '신고': -10., '실패': -10., '오류': -10., '유언비어': -10., '유의': -10., ('이상', '거래'): -10., ('이상', '입금'): -10.,
                         '장애': -10.,
                         '점검': -10., '정검': -10., '정지': -10., '제외': -10., '제재': -10., '제한': -10., '조정': -10., '주의': -10.,
                         '중단': -10.,
                         '중지': -10., '지연': -10., '연기': -10., '처벌': -10., '취소': -10., '탈퇴': -10., '피해': -10., '허위': -10.,
                         '상폐': -10., '제거': -10., '종료': -10., '폐지': -10.,

                         '횡령': -10., '착오': -10., '법원': -10., '범죄': -10., '실수': -10., '디도스': -10., '법적': -10.,
                         '불편': -10., '분실': -10., '가짜': -10., '고장': -10., '끝': -10., '동결': -10., '만료': -10.,
                         '배제': -10., '스캠': -10., '예외': -10., '위법': -10., '지체': -10., '철회': -10.,

                         'btc': -100., 'eth': -100., 'usdt': -100., }

bithumbSubjectSignsDict = {(('상장',), ('지연', '변경', '종료', '폐지')): 1.,

                           '당첨': -10.,

                           '경고': -10., '금지': -10., '늦': -10., '루머': -10.,
                           '마감': -10., '문제': -10., '버그': -10., '변경': -10., '불가능': -10.,
                           '불공정': -10., '불량': -10., '불법': -10., '불안정': -10., '비정상': -10., '사기': -10., '사칭': -10.,
                           '삭제': -10., '수정': -10.,
                           '신고': -10., '실패': -10., '오류': -10., '유언비어': -10., '유의': -10., ('이상', '거래'): -10., ('이상', '입금'): -10.,
                           '장애': -10.,
                           '점검': -10., '정검': -10., '정지': -10., '제외': -10., '제재': -10., '제한': -10., '조정': -10.,
                           '주의': -10.,
                           '중단': -10.,
                           '중지': -10., '지연': -10., '연기': -10., '처벌': -10., '취소': -10., '탈퇴': -10., '피해': -10., '허위': -10.,
                           '상폐': -10., '제거': -10., '종료': -10., '폐지': -10.,

                           '횡령': -10., '착오': -10., '법원': -10., '범죄': -10., '실수': -10., '디도스': -10., '법적': -10.,
                           '불편': -10., '분실': -10., '가짜': -10., '고장': -10., '끝': -10., '동결': -10., '만료': -10.,
                           '배제': -10., '스캠': -10., '예외': -10., '위법': -10., '지체': -10., '철회': -10., }

binanceNoticeDict = {(('list',), ('delist', 'unlist', 'de-list', 'un-list')): 1., 'add': 1., 'open': 1.,
                     'trading on': 1., 'sale': 1.,

                     ####아래는 본인이 직접 선택해야 하는 부정어들####
                     # 안전을 위한다면 모두 -10으로,
                     # 대신 ban=-10 인데 cband나 banana 같은 코인이 나오면 못삼
                     (('ban',), ('bana', 'banb', 'banc', 'bank')): -10.,
                     (('end',), ('lend', 'mend')): -10.,
                     (('lock',), ('block', 'clock')): -10.,
                     (('off',), ('offi', 'offl', 'offe')): -10.,
                     'wait': -10., 'miss': -10., 'dead': -10., 'bug': -10., 'warn': -10., ('take', 'off'): -10.,
                     ('take', 'out'): -10., 'shut': -10., 'issue': -10.,
                     'late': -10., 'leave': -10., 'bad': -10., 'lost': -10., 'airdrop': -10.,
                     ####위는 본인이 직접 선택해야 하는 부정어들####

                     'fail': -1., (('none',), ('coinone',)): -1., 'pend': -1., 'anomaly': -1., 'suspen': -1.,
                     'ddos': -1., 'delay': -1., 'risk': -1., 'maintenance': -1., 'fix': -1., 'sorry': -1., 'abuse': -1.,
                     'improper': -1., 'manipulat': -1., 'investigat': -1., (('chang',), ('exchang',)): -1.,
                     'redemption': -1., 'redeem': -1., 'postpone': -1.,

                     'abandon': -10., 'abolish': -10., 'abolit': -10., 'abort': -10., 'abus': -10., 'adjourn': -10.,
                     'alert': -10., 'annul': -10., 'away with': -10.,
                     'break down': -10., 'broke down': -10., 'broken down': -10., 'call off': -10.,
                     'cancel': -10., 'caution': -10., 'cease': -10., 'criminal': -10.,
                     'debit': -10., 'defect': -10., 'defer': -10.,
                     'disabl': -10., 'disappear': -10., 'discard': -10.,
                     'erase': -10., 'error': -10., 'exclude': -10.,
                     'expiration': -10., 'fake': -10., 'fault': -10., 'finish': -10.,
                     'forbid': -10., 'freeze': -10., 'give up': -10., 'hold over': -10., 'illegal': -10.,
                     'impede': -10., 'imperfect': -10., 'incompetent': -10., 'inconvenient': -10.,
                     'inspect': -10., 'interrupt': -10.,
                     'maintain': -10.,
                     'modification': -10., 'outlaw': -10.,
                     'problem': -10., 'procrastinate': -10., 'prohibit': -10.,
                     'put off': -10., 'quit': -10.,
                     'refund': -10., 'reject': -10., 'repeal': -10., 'restriction': -10.,
                     'revoke': -10., 'rumor': -10., 'sanction': -10., 'scam': -10., 'shelve': -10.,

                     'terminat': -10., 'throw away': -10., 'turn off': -10., 'unfair': -10.,
                     'unstable': -10., 'false': -10.,

                     'remov': -10., 'delet': -10., 'eliminat': -10., 'subtract': -10., 'stop': -10., 'clos': -10.,
                     'de-list': -10., 'unlist': -10., 'un-list': -10., 'delist': -10., }

okexSubjectSignsDict = {'上线': 1, ('全球', '首发', '的公告'): 1.,

                        '故': -10, '变': -10, '失': -10, '失败': -10, '延': -10, '缓': -10, '维护': -10, '障': -10, '停': -10,
                        '调': -10, '迟': -10,
                        '清算': -10, '败': -10, '风险': -10, '下架': -10, ('关于', '交易'): -10.,

                        '返佣': -10, '退票': -10, '退': -10, '完善': -10, '冒用': -10, '未': -10, '结束': -10, '虚': -10,
                        '假': -10, '盗': -10, '不': -10, '发放': -10, '消': -10, '未能': -10, '退出': -10, '提现': -10, '化': -10., }

okexEnSubjectSignsDict = {('now', 'available'): 1., 'launch': 1., 'list': 1., ('trad', 'spot'): 1.,

                          (('support', 'trad'), ('spot',)): -1.,

                          ####아래는 본인이 직접 선택해야 하는 부정어들####
                          # 안전을 위한다면 모두 -10으로,
                          # 대신 ban=-10 인데 cband나 banana 같은 코인이 나오면 못삼
                          (('ban',), ('bana', 'banb', 'banc', 'bank')): -10.,
                          (('end',), ('lend', 'mend')): -10.,
                          (('lock',), ('block', 'clock')): -10.,
                          (('off',), ('offi', 'offl', 'offe')): -10.,
                          'wait': -10., 'miss': -10., 'dead': -10., 'bug': -10., 'warn': -10., ('take', 'off'): -10.,
                          ('take', 'out'): -10., 'shut': -10., 'issue': -10.,
                          'late': -10., 'leave': -10., 'bad': -10., 'lost': -10., 'airdrop': -10.,
                          ####위는 본인이 직접 선택해야 하는 부정어들####

                          'fail': -1., (('none',), ('coinone',)): -1., 'pend': -1., 'anomaly': -1., 'suspen': -1.,
                          'ddos': -1., 'delay': -1., 'risk': -1., 'maintenance': -1., 'fix': -1., 'sorry': -1.,
                          'abuse': -1.,
                          'improper': -1., 'manipulat': -1., 'investigat': -1., (('chang',), ('exchang',)): -1.,
                          'redemption': -1., 'redeem': -1., 'postpone': -1.,

                          'abandon': -10., 'abolish': -10., 'abolit': -10., 'abort': -10., 'abus': -10., 'adjourn': -10.,
                          'alert': -10., 'annul': -10., 'away with': -10.,
                          'break down': -10., 'broke down': -10., 'broken down': -10., 'call off': -10.,
                          'cancel': -10., 'caution': -10., 'cease': -10., 'criminal': -10.,
                          'debit': -10., 'defect': -10., 'defer': -10.,
                          'disabl': -10., 'disappear': -10., 'discard': -10.,
                          'erase': -10., 'error': -10., 'exclude': -10.,
                          'expiration': -10., 'fake': -10., 'fault': -10., 'finish': -10.,
                          'forbid': -10., 'freeze': -10., 'give up': -10., 'hold over': -10., 'illegal': -10.,
                          'impede': -10., 'imperfect': -10., 'incompetent': -10., 'inconvenient': -10.,
                          'inspect': -10., 'interrupt': -10.,
                          'maintain': -10.,
                          'modification': -10., 'outlaw': -10.,
                          'problem': -10., 'procrastinate': -10., 'prohibit': -10.,
                          'put off': -10., 'quit': -10.,
                          'refund': -10., 'reject': -10., 'repeal': -10., 'restriction': -10.,
                          'revoke': -10., 'rumor': -10., 'sanction': -10., 'scam': -10., 'shelve': -10.,

                          'terminat': -10., 'throw away': -10., 'turn off': -10., 'unfair': -10.,
                          'unstable': -10., 'false': -10.,

                          'remov': -10., 'delet': -10., 'eliminat': -10., 'subtract': -10., 'stop': -10., 'clos': -10.,
                          'de-list': -10., 'unlist': -10., 'un-list': -10., 'delist': -10., }

huobiSubjectSignsDict = {('上线', '月', '日'): 1., ('全球通用', '月', '日'): 1., ('全球首发', '月', '日'): 1.,
                         ('交易排名赛', 'top'): 1.,  # 특정 코인의 거래량이 많은 사람에게 보상을 하는 제도, 보통 상장과 함께 진행되는 경우가 많음
                         ('火币', '交易', '月', '日'): 0.,  # 상장이 아니지만 거래의 시작이나 마진 거래를 알리는 문구, 추후에 1로 상향 가능

                         '全面': -1., '项目': -1., '法币': -1., '发布': 0., '广告': -1., '调整': -1.,
                         '费率': -1., '更新': -1., '系统': -1., '及大宗': -1., '国际化': -1., '平台': -1.,
                         '方案': -1., '态度': -1., '用户': -1., '回馈': -1., '分叉': -1., '开采': -1., '平台的': -1.,
                         '维护': -1., '充值': -1., '理方案': -1., '提现的公告': -1., '充提业务': -1., '充值业务': -1.,
                         '领取': -1., '积分': 0., '官方': -1., '准时': -1., '投票': -1., '开启': -1.,
                         '二轮': -1., '专场': -1., '活动第': -1., '招募': -1., '商家': -1., '进行': -1., '第三期': -1.,
                         '处': -1., '狂撒': -1., '新注册就': -1., '各种': -1., '一轮': -1., '结果': -1., '返还': -1.,
                         '充币': -1., '期间': -1., '规则': -1., '手续费': -1., '赢': -1., '买免': -1., '活动': -1.,
                         '节点': -1., '识': -1., '答题': -1., '三轮': -1., '合作': -1., '将为': -1.,
                         '免息': -1., '卡疯': -1., '示': -1., '地址': -1., '更名': -1., '入围': -1., '游': -1., '持仓': -1.,
                         '进': -1., '专享': -1., '征求': -1., '定稿': -1., '意见': -1., '期至': -1.,
                         '支持': -1., '影响': -1., '列表': -1., '详情': -1., '套餐': 0., '名单': -1., '新年': -1.,
                         '机制': -1., '元旦': -1., '上调': -1., '网站': -1., '盗用': -1., '优惠': -1., '认证': -1., '的声': -1.,
                         '资料': -1., '现金': -1., '分发': -1., '已完': -1., '邀': -1., '升级': -1.,
                         '补偿': -1., '都有': 0., '继续': -1., '抢购': -1., '全民': -1., '狂欢': -1., '设立': -1., '功能': -1.,
                         '并赠': 0., '连续': -1., '社群': -1., '额度': -1., '安全': -1., '名义': -1., '最小': -1., '欢迎': -1.,
                         '扩量': -1., '临时': -1., '产品': -1., '服务': -1., '再次': -1., '不间断': -1.,

                         '返佣': -10., '退票': -10., '延': -10., '退出': -10., '完善': -10.,
                         '未能': -10., '结束': -10., '冒用': -10., '迟': -10,

                         '故': -10, '变': -10, '失': -10, '失败': -10, '缓': -10, '障': -10, '停': -10, '调': -10,
                         '清算': -10, '败': -10, '风险': -10, '下架': -10, ('关于', '交易'): -10., '退': -10, '未': -10,
                         '虚': -10, '假': -10, '盗': -10, '不': -10, '发放': -10, '消': -10, '提现': -10, '化': -10., }

sgbSignsDict = {'new wallet':1., 'Hitbtc':-2., }

# 发放=문제는 정말 부정어인가?444
# okex의 ('关于(정보)', '交易(거래)')는 후오비에서도 부정어로 작용할까? 1/7이 상장 1111 
# 关에 turn off라는 부정적인 의미도 있지만 상장과 함께 사용되는 경우가 있어 고려대상 왜 수정이 안 되냐222
# 공통부정어에서 겹치는 부분은 제거해줌 ㅋㅋㅋㅋ3333
